# utils/i18n/general/en.py
TRANSLATIONS = {
     "boxplot_charts": {
                "boxplot": "Ящичные диаграммы (BoxPlot)",
                "boxplot_desc": "Визуализация распределения данных и идентификация выбросов. Ящичные диаграммы обеспечивают быстрое понимание распределения данных, показывая медиану, квартили и выбросы. Они особенно полезны для выявления потенциальных ошибок измерения или необычных наблюдений.",
                "title": "Ящичные диаграммы (BoxPlot)",
                "instructions": {
                    "header": "Инструкции",
                    "upload_file": "Загрузите файл Excel с данными измерений.",
                    "select_columns": "Выберите столбцы для анализа, чтобы создать ящичные диаграммы.",
                    "view_stats": "Вы получите описательную статистику для выбранных столбцов."
                },
                "file_handling": {
                    "choose_file": "Выберите файл Excel (xlsx, xls):",
                    "show_data_preview": "Показать предварительный просмотр данных",
                    "data_preview": "Предварительный просмотр данных (первые 5 строк):",
                    "select_columns": "Выберите столбцы для анализа:",
                    "error_processing_file": "Произошла ошибка при анализе файла",
                    "no_file_uploaded": "Файл не выбран - пожалуйста, загрузите файл Excel выше."
                },
                "plot": {
                    "title": "Ящичные диаграммы для выбранных столбцов",
                    "y_label": "Значения"
                },
                "statistics": {
                    "title": "Описательная статистика"
                }
            },
           
           
}