# utils/i18n/general/en.py
TRANSLATIONS = {
    "general": {
                "menu_title": "Меню",
                "intro": "Добро пожаловать в приложение Santo Pharmstat!",
                "intro_desc": "Приложение позволяет просто и интуитивно проводить анализ статистических и качественных данных. В боковом меню вы найдёте модули, которые помогут вам анализировать данные с различных позиций.",
                "choose_page": "Выберите страницу:",
                "upload_data": "Загрузите данные для анализа с помощью встроенных форм.",
                "view_results": "Результаты анализа (графики, таблицы, статистика) появятся в главной области страницы.",
                "customize_view": "Вы можете скрывать или отображать детали анализа, настраивая вид согласно вашим потребностям.",
                "how_to_use": "Как использовать приложение?"
            }
}
