# utils/i18n/general/en.py
TRANSLATIONS = {
   "descriptive_statistics": {
                "descriptive_stats": "Описательная статистика",
                "descriptive_stats_desc": "Вычисление основных статистических показателей, таких как среднее значение, медиана, стандартное отклонение. Этот модуль позволяет быстро и легко получить основную информацию о ваших данных, что является ключевым для дальнейшего анализа. Описательная статистика является основой анализа данных, так как позволяет быстро понять распределение и изменчивость данных.",
                "title": "Описательная статистика",
                "instructions": {
                    "header": "Инструкции",
                    "upload_file": "Загрузите файл Excel с данными измерений.",
                    "select_columns": "Выберите столбцы для расчета описательной статистики.",
                    "stats_summary": "Вы получите сводку основных статистических показателей, таких как среднее значение, медиана, стандартное отклонение и другие.",
                    "normality_skew_kurtosis": "Дополнительно вы сможете оценить нормальность распределения и получить информацию о асимметрии и эксцессе."
                },
                "file_handling": {
                    "choose_file": "Выберите файл Excel (xlsx или xls):",
                    "show_data_preview": "Показать предварительный просмотр загруженных данных",
                    "data_preview": "Предварительный просмотр загруженных данных (первые 10 строк):",
                    "select_columns": "Выберите столбцы для анализа:",
                    "error_processing_file": "Произошла ошибка при анализе файла",
                    "no_file_uploaded": "Файл не выбран - пожалуйста, загрузите файл Excel выше."
                },
                "statistics": {
                    "shapiro_test": "Шапиро-Уилка p-значение",
                    "skewness": "Асимметрия",
                    "kurtosis": "Эксцесс"
                }
            },
           
}